app/views/students/show.html.erb

SELECT "team_dues".* FROM "team_dues" WHERE "team_dues"."student_id" = 1 ORDER BY year DESC
---
      </tr>
      <% @student.team_dues.order('year DESC').each do |team_due|  %>

SELECT "medical_forms".* FROM "medical_forms" WHERE "medical_forms"."student_id" = 1 ORDER BY date DESC
---
      </tr>
      <% @student.medical_forms.order('date DESC').each do |medical_form| %>

SELECT "parent_permission_forms".* FROM "parent_permission_forms" WHERE "parent_permission_forms"."student_id" = 1
SELECT "teacher_permission_forms".* FROM "teacher_permission_forms" WHERE "teacher_permission_forms"."student_id" = 1
---
      </tr>
      <% @student.parent_permission_forms.each do |form| %>

SELECT "trip_deposits".* FROM "trip_deposits" WHERE "trip_deposits"."student_id" = 1
---
      </tr>
      <% @student.trip_deposits.each do |trip_deposit| %>

SELECT "trip_fees".* FROM "trip_fees" WHERE "trip_fees"."student_id" = 1
---
      </tr>
      <% @student.trip_fees.each do |trip_fee| %>