app/views/team_dues/new.html.erb

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "1"]]
---
    <input type="hidden" name="student_id" value=<%= params[:student_id] %> />
    <input type="text" value="<%= Student.find(params[:student_id]).full_name %>" disabled />