app/controllers/medical_forms_controller.rb

  def create
    @medical_form = Student.find(params[:student_id]).medical_forms.new params[:medical_form]
    if @medical_form.save
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "medical_forms" ("created_at", "date", "student_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 12 Dec 2012 03:29:59 UTC +00:00], ["date", Tue, 11 Dec 2012], ["student_id", 1], ["updated_at", Wed, 12 Dec 2012 03:29:59 UTC +00:00]]