app/controllers/safety_tests_controller.rb

  def create
    @safety_test = Student.find(params[:student_id]).safety_tests.new params[:safety_test]
    if @safety_test.save
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "safety_tests" ("created_at", "student_id", "updated_at", "year") VALUES (?, ?, ?, ?)  [["created_at", Wed, 12 Dec 2012 03:17:06 UTC +00:00], ["student_id", 1], ["updated_at", Wed, 12 Dec 2012 03:17:06 UTC +00:00], ["year", 2013]]