app/controllers/students_controller.rb

SELECT "students".* FROM "students" ORDER BY last_name
---
  def index
    authorize Student
    @students = Student.all

INSERT INTO "students" ("created_at", "father_name", "first_name", "last_name", "mother_name", "parent_cell_phone", "parent_email", "parent_home_phone", "preferred_language", "student_cell_phone", "student_email", "student_id", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    authorize Student
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save