app/controllers/team_dues_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "team_dues" ("created_at", "student_id", "updated_at", "year") VALUES (?, ?, ?, ?)  [["created_at", Wed, 12 Dec 2012 03:09:28 UTC +00:00], ["student_id", 1], ["updated_at", Wed, 12 Dec 2012 03:09:28 UTC +00:00], ["year", 2013]]
---
  def create
    @team_due = Student.find(params[:student_id]).team_dues.new params[:team_due]
    if @team_due.save